In [1]:
# Import libraries

import pandas as pd
import numpy as np
import os

In [5]:
# Define a dictionary containing January 2020 data
data1 = {'customer_id':['6732', '767', '890', '635'],
    'month':['Jan-20', 'Jan-20', 'Jan-20', 'Jan-20'],
    'purchased_meat':[0, 13, 3, 4],
    'purchased_alcohol':[1, 2, 10, 0],
    'purchased_snacks':[10, 5, 1, 7]}

In [3]:
data2 = {'customer_id':['6732', '767', '890', '635'],
    'month':['Feb-20', 'Feb-20', 'Feb-20', 'Feb-20'],
    'purchased_meat':[0, 10, 5, 3],
    'purchased_alcohol':[2, 4, 14, 0],
    'purchased_snacks':[15, 3, 2, 6]}

In [4]:
data1

{'customer_id': ['6732', '767', '890', '635'],
 'month': ['Jan-20', 'Jan-20', 'Jan-20', 'Jan-20'],
 'purchased_meat': [0, 13, 3, 4],
 'purchased_alcohol': [1, 2, 10, 0],
 'purchased_snacks': [10, 5, 1, 7]}

In [6]:
#Convert the dictionary into dataframe
df_1 = pd.DataFrame(data1,index = [0,1,2,3])
df_2 = pd.DataFrame(data2,index = [0,1,2,3])

In [7]:
df_1

  customer_id   month  purchased_meat  purchased_alcohol  purchased_snacks
0        6732  Jan-20               0                  1                10
1         767  Jan-20              13                  2                 5
2         890  Jan-20               3                 10                 1
3         635  Jan-20               4                  0                 7

In [8]:
df_2

  customer_id   month  purchased_meat  purchased_alcohol  purchased_snacks
0        6732  Feb-20               0                  2                15
1         767  Feb-20              10                  4                 3
2         890  Feb-20               5                 14                 2
3         635  Feb-20               3                  0                 6

In [11]:
#Concatenate (long range)
frames = (df_1,df_2)
df_concat = pd.concat(frames)

In [12]:
df_concat

  customer_id   month  purchased_meat  purchased_alcohol  purchased_snacks
0        6732  Jan-20               0                  1                10
1         767  Jan-20              13                  2                 5
2         890  Jan-20               3                 10                 1
3         635  Jan-20               4                  0                 7
0        6732  Feb-20               0                  2                15
1         767  Feb-20              10                  4                 3
2         890  Feb-20               5                 14                 2
3         635  Feb-20               3                  0                 6

In [13]:
#concatenate (wide range)
df_concat_1 = pd.concat(frames ,axis = 1)

In [14]:
df_concat_1

,customer_id,month,purchased_meat,purchased_alcohol,purchased_snacks,customer_id,month,purchased_meat,purchased_alcohol,purchased_snacks
0,6732,Jan-20,0,1,10,6732,Feb-20,0,2,15
1,767,Jan-20,13,2,5,767,Feb-20,10,4,3
2,890,Jan-20,3,10,1,890,Feb-20,5,14,2
3,635,Jan-20,4,0,7,635,Feb-20,3,0,6

In [16]:
data3 = {'customer_id' : ['6732','767','890','635'],
        'month' : ['Jan-20','Jan-20','Jan-20','Jan-20'],
        'days_purchased_on':[0, 10, 4, 1]}

In [26]:
df_3 = pd.DataFrame(data3,index = [0,1,2,3])

In [27]:
df_merged = df_1.merge(df_3,on = 'customer_id')

In [28]:
df_merged

,customer_id,month_x,purchased_meat,purchased_alcohol,purchased_snacks,month_y,days_purchased_on
0,6732,Jan-20,0,1,10,Jan-20,0
1,767,Jan-20,13,2,5,Jan-20,10
2,890,Jan-20,3,10,1,Jan-20,4
3,635,Jan-20,4,0,7,Jan-20,1

Here you can see two similar columns month_x ans month_y ,these month and customer_id is common col between two DF.you didn’t specify it as a key, like you did the “customer_id” column, it’s duplicated in the final dataframe

In [31]:
df_merged = df_1.merge(df_3,on = ['customer_id','month'])

In [32]:
df_merged

,customer_id,month,purchased_meat,purchased_alcohol,purchased_snacks,days_purchased_on
0,6732,Jan-20,0,1,10,0
1,767,Jan-20,13,2,5,10
2,890,Jan-20,3,10,1,4
3,635,Jan-20,4,0,7,1

In [33]:
df_merged = df_1.merge(df_3,on = ['customer_id','month'],indicator = True)

In [34]:
df_merged

,customer_id,month,purchased_meat,purchased_alcohol,purchased_snacks,days_purchased_on,_merge
0,6732,Jan-20,0,1,10,0,both
1,767,Jan-20,13,2,5,10,both
2,890,Jan-20,3,10,1,4,both
3,635,Jan-20,4,0,7,1,both

value in _merge is both which means there is full match between the data frame in every rows

Merging on InstaCart Data   
Merging Orders.csv with orders_products_prior.csv

In [3]:
path2 = r'C:\Users\91928\Documents\Instacart Basket Analysis\Data\Prepared Data'

In [5]:
#Importing orders.csv
path = r'C:\Users\91928\Documents\Instacart Basket Analysis\Data\Original Data'
df_ords = pd.read_csv(os.path.join(path2,'orders_wrangled.csv'),index_col = False)

In [8]:
df_ords.rename(columns = {'order_dow' : 'order_day'},inplace = True)

In [9]:
df_ords.rename(columns = {'orders_dow ' : 'orders_day'},inplace = True)

In [9]:
#Importing products.csv
df_ords_prior = pd.read_csv(os.path.join(path,'orders_products_prior.csv'),index_col = False)

In [11]:
df_ords_prior.shape

(32434489, 4)

In [11]:
df_ords_prior.describe().applymap('{:,.2f}'.format)

            order_id     product_id add_to_cart_order      reordered
count  32,434,489.00  32,434,489.00     32,434,489.00  32,434,489.00
mean    1,710,748.52      25,576.34              8.35           0.59
std       987,300.70      14,096.69              7.13           0.49
min             2.00           1.00              1.00           0.00
25%       855,943.00      13,530.00              3.00           0.00
50%     1,711,048.00      25,256.00              6.00           1.00
75%     2,565,514.00      37,935.00             11.00           1.00
max     3,421,083.00      49,688.00            145.00           1.00

In [12]:
df_ords_prior.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [13]:
df_ords.head()

,Unnamed: 0,order_id,user_id,eval_set,order_number,order_day,order_hour_of_day,days_since_prior_order
0,0,2539329,1,prior,1,2,8,NaN
1,1,2398795,1,prior,2,3,7,15.0
2,2,473747,1,prior,3,3,12,21.0
3,3,2254736,1,prior,4,4,7,29.0
4,4,431534,1,prior,5,4,15,28.0

In [14]:
df_ords_prior.shape

(32434489, 4)

In [15]:
df_ords.shape

(3421083, 8)

In [13]:
#Merging Orders DF with orders_prior Df with inner join
df_ords_merged = df_ords.merge(df_ords_prior,on = 'order_id',indicator = True)

In [15]:
df_ords_merged.shape

(32434489, 12)

In [17]:
df_ords_merged.head()

,Unnamed: 0,order_id,user_id,eval_set,order_number,order_day,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge
0,0,2539329,1,prior,1,2,8,NaN,196,1,0,both
1,0,2539329,1,prior,1,2,8,NaN,14084,2,0,both
2,0,2539329,1,prior,1,2,8,NaN,12427,3,0,both
3,0,2539329,1,prior,1,2,8,NaN,26088,4,0,both
4,0,2539329,1,prior,1,2,8,NaN,26405,5,0,both

In [18]:
 #results of the merge using the merge flag.
df_ords_merged['_merge'].value_counts()

both          32434489
right_only           0
left_only            0
Name: _merge, dtype: int64

In [19]:
#Merging Orders DF with orders_prior Df with outer join
df_ords_merged_outer = df_ords.merge(df_ords_prior,on = 'order_id', how = 'outer',indicator = True)

In [20]:
df_ords_merged_outer['_merge'].value_counts()

both          32434489
left_only       206209
right_only           0
Name: _merge, dtype: int64

In [21]:
df_ords_merged_outer.shape

(32640698, 12)

In [22]:
#Export the newly created dataframe as orders_products_combined.pkl in a pickle format
df_ords_merged_outer.to_pickle(os.path.join(path2,'orders_products_combined.pkl'))